package com.yrwl.constants;

/**
 * @author shentao
 * @date 2019-12-17
 */
public class CommonConst {

    /**
     * 版本号
     */
    public static final String VERSION = "/api/v1/";

    /**
     * 访问access_token
     */
    public static final String ACCESS_TOKEN = "access_token";

    /**
     * token有效期(秒)
     */
    public static final int EXPIRY_DATE = 7200;

    /**
     * 优惠券分布式锁
     */
    public static final String LOCK_COUPONS = "lock_coupons:";

    /**
     * 日期+时间格式正则
     */
    public static final String REGEXP_DATETIME = "^((([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29))(\\s(((0?[0-9])|([1][0-9])|([2][0-4]))\\:([0-5]?[0-9])((\\s)|(\\:([0-5]?[0-9])))))?$";

    /**
     * 日期格式正则
     */
    public static final String REGEXP_DATE = "(([0-9]{3}[1-9]|[0-9]{2}[1-9][0-9]{1}|[0-9]{1}[1-9][0-9]{2}|[1-9][0-9]{3})-(((0[13578]|1[02])-(0[1-9]|[12][0-9]|3[01]))|((0[469]|11)-(0[1-9]|[12][0-9]|30))|(02-(0[1-9]|[1][0-9]|2[0-8]))))|((([0-9]{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)$";
}
